# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
import pandas as pd
from sqlalchemy import create_engine
driver = 'mysql+pymysql'
ip = '34.65.10.136'
username = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
db = 'publications'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
#df.read_sql()
#df.to_sql()
pd.read_sql_query('SELECT a.`au_id`, titles.`title` FROM authors a JOIN titleauthor ta on a.au_id = ta.`au_id` JOIN titles on ta.`title_id` = titles.title_id;', connection_string)

          au_id                                              title
0   213-46-8915                The Busy Executive's Database Guide
1   409-56-7008                The Busy Executive's Database Guide
2   267-41-2394  Cooking with Computers: Surreptitious Balance ...
3   724-80-9391  Cooking with Computers: Surreptitious Balance ...
4   213-46-8915                    You Can Combat Computer Stress!
5   274-80-9391                      Straight Talk About Computers
6   712-45-1867                  Silicon Valley Gastronomic Treats
7   722-51-5454                              The Gourmet Microwave
8   899-46-2035                              The Gourmet Microwave
9   238-95-7766                           But Is It User Friendly?
10  427-17-2319                          Secrets of Silicon Valley
11  846-92-7186                          Secrets of Silicon Valley
12  486-29-1786                                      Net Etiquette
13  724-80-9391  Computer Phobic AND Non-Phobic Individuals: Be...
14  756-30-7391  Computer Phobic AND Non-Phobic Individuals: Be...
15  899-46-2035                                Is Anger the Enemy?
16  998-72-3567                                Is Anger the Enemy?
17  998-72-3567                                  Life Without Fear
18  172-32-1176      Prolonged Data Deprivation: Four Case Studies
19  486-29-1786                Emotional Security: A New Algorithm
20  807-91-6654  Onions, Leeks, and Garlic: Cooking Secrets of ...
21  648-92-1872          Fifty Years in Buckingham Palace Kitchens
22  267-41-2394                                     Sushi, Anyone?
23  472-27-2349                                     Sushi, Anyone?
24  672-71-3249                                     Sushi, Anyone?

# Challenge 2 - Working with JSON files

Import the pandas library.

In [2]:
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [3]:
nasa = pd.read_json('../data/nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [4]:
nasa.head(0)

Empty DataFrame
Columns: [:@computed_region_cbhk_fwbd, :@computed_region_nnqa_25f4, fall, geolocation, id, mass, name, nametype, recclass, reclat, reclong, year]
Index: []

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [5]:
nasa.loc[:,'fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [16]:
nasa.to_json('../data/nasa-output.json', orient = 'records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [7]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [8]:
shuttle = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst',sep=' ', names = cols)

Let's verify that this worked by looking at the `head()` function.

In [9]:
shuttle.head(0)

Empty DataFrame
Columns: [time, rad_flow, fpv_close, fpv_open, high, bypass, bpv_close, bpv_open, class]
Index: []

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [10]:
shuttle.to_csv('../data/shutle.csv',sep=",",index = False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [11]:
astronaut = pd.read_excel('../data/astronauts.xls')
astronaut

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,David A. Wolf,1990.0,13.0,Retired,1956-08-23,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,NaN,NaN,3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaT,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,1962-07-26,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,NaN,NaT,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,1932-02-07,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaT,NaN
355,John W. Young,1962.0,2.0,Retired,1930-09-24,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,NaN,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaT,NaN
356,George D. Zamka,1998.0,17.0,Retired,1962-06-29,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaT,NaN

Use the `head()` function to inspect the dataframe.

In [12]:
astronaut.head(0)

Empty DataFrame
Columns: [Name, Year, Group, Status, Birth Date, Birth Place, Gender, Alma Mater, Undergraduate Major, Graduate Major, Military Rank, Military Branch, Space Flights, Space Flight (hr), Space Walks, Space Walks (hr), Missions, Death Date, Death Mission]
Index: []

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [13]:
astronaut.loc[:,'Undergraduate Major'].value_counts()

Physics                                     35
Aerospace Engineering                       33
Mechanical Engineering                      30
Aeronautical Engineering                    28
Electrical Engineering                      23
                                            ..
Astronomy                                    1
Computer & Systems Engineering               1
Electrical Engineering; Computer Science     1
Physics & Astronautical Engineering          1
Industrial Management                        1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [14]:
astronaut.to_csv('../data/astronaut.csv',sep="\t",index = False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [15]:
# your code here